# SQL Bootcamp Material

### Import modules and SQLite Database

In [21]:
# !wget https://github.com/gt-cse-6040/bootcamp/raw/main/SQL/syllabus/university.db

In [22]:
import pandas as pd
from pprint import pprint, pformat

import sqlite3
conn=sqlite3.connect('university.db')

## In this notebook, we are going to introduce the `university` database, which we will be using in today's session.

#### This database was used in the Spring 2025 MT2, and it is the database used in the videos for the SQL Student Review Content.

The main difference between this database, and the `NYC calls` database, that we have been using in the sessions up to now, is that it contains multiple tables that contain specific data, versus a single table with everything in it.

### Everything we are doing below was covered in the first Bootcamp SQL session, so if you have questions on what we are doing, please go back and review the notebooks from that session.

### Database and table metadata

*    https://www.sqlite.org/schematab.html
*    https://www.sqlite.org/pragma.html

In [23]:
def gettablescema() -> str:
  return """
    SELECT *
    FROM sqlite_master
    WHERE type='table'
  """
pd.read_sql(gettablescema(),conn)

,type,name,tbl_name,rootpage,sql
0,table,student_main,student_main,2,CREATE TABLE student_main (\n\tstudent_id VARC...
1,table,major_crosswalk,major_crosswalk,4,CREATE TABLE major_crosswalk (\n\tid INTEGER N...
2,table,scholarship_crosswalk,scholarship_crosswalk,5,CREATE TABLE scholarship_crosswalk (\n\tid INT...
3,table,student_key,student_key,6,CREATE TABLE student_key (\n\tstudent_id VARCH...
4,table,student_enrollment,student_enrollment,8,CREATE TABLE student_enrollment (\n\tid INTEGE...
5,table,graduation,graduation,9,CREATE TABLE graduation (\n\tid INTEGER NOT NU...
6,table,scholarship_rules,scholarship_rules,10,CREATE TABLE scholarship_rules (\n\tid INTEGER...
7,table,student_scholarship,student_scholarship,11,CREATE TABLE student_scholarship (\n\tid INTEG...

In [24]:
def tablemetadata(tablename: str) -> str:
  return f"""
    PRAGMA table_info('{tablename}')
  """

for tablename in ['student_main','student_scholarship']:
  print(f'tablename: {tablename}')
  display(pd.read_sql(tablemetadata(tablename),conn))
  print('=================')

tablename: student_main

    cid            name        type  notnull dflt_value  pk
0     0      student_id  VARCHAR(9)        1       None   1
1     1       last_name     VARCHAR        1       None   0
2     2      first_name     VARCHAR        1       None   0
3     3  middle_initial  VARCHAR(1)        0       None   0
4     4           email     VARCHAR        0       None   0
5     5          gender  VARCHAR(1)        1       None   0
6     6       ethnicity     VARCHAR        1       None   0
7     7         address     VARCHAR        1       None   0
8     8      us_citizen  VARCHAR(1)        1       None   0
9     9     us_resident  VARCHAR(1)        1       None   0
10   10  state_resident  VARCHAR(1)        1       None   0
11   11  pell_recipient  VARCHAR(1)        1       None   0
12   12      us_veteran  VARCHAR(1)        1       None   0

=================
tablename: student_scholarship

   cid                 name         type  notnull dflt_value  pk
0    0                   id      INTEGER        1       None   1
1    1           finance_id  VARCHAR(12)        0       None   0
2    2     scholarship_term   VARCHAR(6)        0       None   0
3    3     scholarship_code      VARCHAR        0       None   0
4    4    scholarship_total      INTEGER        0       None   0
5    5  scholarship_payment      INTEGER        0       None   0
6    6   scholarship_refund      INTEGER        0       None   0

=================

In [25]:
def querytables(tablename: str,limit:int=10) -> str:
  return f"""
    SELECT *
    FROM {tablename}
    LIMIT {limit}
  """

for tablename in ['student_main','student_scholarship']:
  print(f'tablename: {tablename}')
  display(pd.read_sql(querytables(tablename),conn))
  print('=================')

tablename: student_main

,student_id,last_name,first_name,middle_initial,email,gender,ethnicity,address,us_citizen,us_resident,state_resident,pell_recipient,us_veteran
0,785657448,Nolan,Amy,None,kcooper@example.net,F,B,"0562 Michelle Drives Suite 738, Spearsbury, HI...",Y,Y,Y,Y,N
1,191366001,Figueroa,Carlos,None,hudsoncourtney@example.com,F,B,"2609 Bethany Village Suite 834, East Nicholasf...",Y,Y,N,N,Y
2,407722073,Yates,Cody,None,victormurphy@example.org,M,A,"5890 Pena Squares Suite 369, Johnsland, AL 03146",Y,N,N,N,N
3,584919956,Williams,Heather,W,None,M,P,"145 Dorsey Harbor Suite 659, Marychester, AR 5...",Y,Y,Y,N,N
4,405120714,Robinson,Sherry,M,emily05@example.net,M,W,"89174 Kristin Meadow Suite 722, East Dawnfurt,...",N,Y,Y,Y,N
5,436547538,Brown,Jessica,None,nancy94@example.org,F,W,"5810 Ashley Canyon Apt. 049, Port Kyle, RI 94809",Y,Y,Y,N,N
6,278234390,Mccarthy,Jason,None,tuckerdeanna@example.com,M,N,"0765 Rachael Oval Suite 104, Jessicaberg, NE 2...",Y,Y,Y,N,N
7,274656787,Li,Vincent,Q,None,F,P,"7326 Haynes Corners Suite 724, Danieltown, MA ...",Y,Y,Y,N,N
8,407347424,Murphy,Kenneth,None,johnrush@example.org,M,A,"624 Jeremiah Union, Lake Kimberly, DE 21754",Y,Y,N,N,N
9,894477940,Brady,Shane,None,kenneth60@example.net,M,B,"368 Joseph Harbor, Sarahport, LA 24669",Y,N,Y,N,N

=================
tablename: student_scholarship

,id,finance_id,scholarship_term,scholarship_code,scholarship_total,scholarship_payment,scholarship_refund
0,1,677708223363,201801,PRE,1500,0,1500
1,2,677708223363,202101,PRE,1500,1500,0
2,3,677708223363,202108,PRE,1500,954,546
3,4,677708223363,202101,PRE,1500,0,1500
4,5,677708223363,202105,PRE,1500,1500,0
5,6,677708223363,202108,PRE,1500,1500,0
6,7,677708223363,202101,PRE,1500,1500,0
7,8,677708223363,202308,PRE,1500,804,696
8,9,677708223363,202301,PRE,1500,1500,0
9,10,677708223363,202405,PRE,1500,0,1500

=================

We then encapsulate that entire query as a derived table, and filter the top five through the where clause on the outside.